# использование переменных необходимо, если мы хотим написать программу, использующую пользовательский ввод
# input() - читает строку пользователя с клавиатуры
input('Введите данные ')

s = input()  # запись в переменную пользовательского ввода

a = int(input())  # прочитать строку, преобразовать в число и записать

# print('output') вывод данных
