# Найдите результат выражения для заданных значений aa и bb. Учитывайте регистр символов при ответе.

a = True
b = False
print(a and b or not a and not b)

# true and false = false
# not true = false
# not false = true
# false and true = false
# false or false = false