# Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

imput = set()
imput.add(2)
imput.add(6)
imput.add(-3)
imput.add(0)

print(imput)
