# В рамках данного урока мы будем называть функциями не только функции.

# Дело в том, что строго говоря в python функцией можно назвать то,
# у чего есть тип function.

# Но с другой стороны, если мы смотрим конструктор какого-нибудь типа,
# например int, он тоже принимает какие-то аргументы и возвращает какие-то значения.

# В метод мы тоже можем передать какие-то аргументы и получить какое-нибудь значение,
# ровно так же, как и в функцию.

# Здесь мы можем применить метод так называемой "Уточной типизации":
# Если что-то плавает как утка, крякает как утка и похожа на утку,
# то вполне вероятно, что это утка.

# Ровно также мы будем относиться к функциям в данном уроке.
# Все что можно вызвать, все что принимает аргументы и все, что возвращает значения
# мы будем называть функцией в течении данного урока.
