# Может быть так, тчо для решения задачи не хватает стандартных средств языка python.
# Однако, если задача является не редкой, а распространенной и ее успешно, кто-то уже решил,
# наверняка есть пакет, который можно скачать.
# Чтобы переиспользовать для решения нашей задачи.

# Для этого есть PyPI - the Python Package Index
# Он содержит большое число пакетов, которые разработаны под язык python.
# Можно найти нужный себе пакет и его использовать.
# Чаще всего модули устанавливаются с помощью утилиты pip.
