# Ежедневно сотни тысяч людей программируют на языке python.
# Однако программирование -- это не лишь написание самого кода.

# На самом деле, мы больше читаем код нежели его пишем.
# Мы читаем код наших коллег, мы читаем свой собственный код, когда баг,
# читаем код однокурсников, когда списываем, читаем код на GitHub той или иной библиотеки.

# Поэтому очень важно, чтобы внутри нашего сообщества людей, которые разрабатывают на python
# код выглядел стилистически одинаково.
# Лишь с одной целью -- чтобы его было проще читать.

# Основная проблема заключается в том, что если с синтаксисом все более или менее понятно,
# ты допускаешь синтаксическую ошибку - твоя программа не компилируется - ты исправляешь
# синтаксическую ошибку.

# Со стилистикой все хуже.
# Что одному кажется красивым и понятным, второму может показаться абсолютно неудобным.

# Однако в языке python есть документ, который содержит в себе стилистические рекомендации
# по написанию кода на языке python.
# Он называется pep8. pep сокращенно от python enchantment proposal.

# Документ pep8 содержит в себе большое количество информации.
# От рекомендуемого размера отступа (когда ставить пробелы вокруг =, когда нет) и до
# того как лучше именовать константы, классы, переменные, функции.
# Все это нужно лишь для того, чтобы нам всем было удобно одинаково читать программу на языке python.
