# Однако сложно на лету замечать у себя стилистические ошибки.
# В этом нам помогает PyChar и консольная утилита pep8.

# Если вы используете среду разработки PyCharm, то стилистические ошибки pep8
# будут подсвечиваться серым цветом, также будет упоминаться pep8 и какая это ошибка.

# pip install pep8 - если работать в консоли.

# Нужно уметь находить глазами стилистические ошибки в своем коде, однако,
# если глаза подводят, то можно воспользоваться PyCharm или консольной утилитой pep8.

# Нужно как можно раньше уделять внимание стилю своего программирования,
# потому что плохие привычки достаточно сложно искоренить.
