print("Программа получает на вход 3 числа и равнивает их между собой. Выдает максимум и минимум")
print("Введите первое число >")
first_number = int(input())
print("введите второе число >")
second_number = int(input())
print("введите второе число >")
third_number = int(input())

print("max=", max(first_number, second_number, third_number), "min=", min(first_number, second_number, third_number))
