# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.


string_1 = input()
string_2 = input()

print(string_1.count(string_2))
