# Давайте подытожим все сказаное

# Прежде всего с синтаксисисом класса к нам пришли 3 новых типа:
# 1. Объекты классы - описывают сами классы и их поведение
# 2. Объекты экземпляры - это те объекты, тип которых и есть наш класс
# 3. Связанные методы - они ссылаются на объект и ссылаются на функцию внутри класса

# Что мы с этими типами можем сделать?

# С объектами классами, во-первых, можем вызвать конструктор, а во-вторых, создавать и обращаться
# к каким-то атрибутам.
# У объектов экземпляров мы можем лишь создавать и обращаться к атрибутам.
# А у связанных методов мы можем лишь их вызывать.

# Попробуем все эти знания устаканить.
# Давайте посмотрим иллюстрацию получше.
# 1 стрелка - глобальные имена, 2 - код, который мы исполняем, 3 - состояние оперативной памяти.
